In [9]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [10]:
# importing the dataset
data1 = pd.read_csv('Social_Network_Adds.csv')
data1

      User ID  Age  EstimatedSalary  Purchased  Gender
0    15624510   19            19000          0    Male
1    15810944   35            20000          0    Male
2    15668575   26            43000          0  Female
3    15603246   27            57000          0  Female
4    15804002   19            76000          0    Male
..        ...  ...              ...        ...     ...
395  15691863   46            41000          1  Female
396  15706071   51            23000          1    Male
397  15654296   50            20000          1  Female
398  15755018   36            33000          0    Male
399  15594041   49            36000          1  Female

[400 rows x 5 columns]

In [11]:
print(data1.shape)

(400, 5)

In [12]:
X = pd.DataFrame(data1.iloc[:, :-1])
y = pd.DataFrame(data1.iloc[:, -1])

In [13]:
X

      User ID  Age  EstimatedSalary  Purchased
0    15624510   19            19000          0
1    15810944   35            20000          0
2    15668575   26            43000          0
3    15603246   27            57000          0
4    15804002   19            76000          0
..        ...  ...              ...        ...
395  15691863   46            41000          1
396  15706071   51            23000          1
397  15654296   50            20000          1
398  15755018   36            33000          0
399  15594041   49            36000          1

[400 rows x 4 columns]

In [14]:
y

     Gender
0      Male
1      Male
2    Female
3    Female
4      Male
..      ...
395  Female
396    Male
397  Female
398    Male
399  Female

[400 rows x 1 columns]

In [15]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=1)

In [16]:
# fitting logistic regression on the training set
from sklearn.linear_model import LogisticRegression
classifier = LogisticRegression( )
print(classifier.fit(X_train, y_train))

C:\Users\Sandip\anaconda3\lib\site-packages\sklearn\utils\validation.py:993: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

LogisticRegression()

In [17]:
# predicting the test set result
y_pred = classifier.predict(X_test)

In [18]:
y_pred

array(['Male', 'Male', 'Female', 'Female', 'Female', 'Male', 'Male',
       'Female', 'Male', 'Female', 'Female', 'Female', 'Female', 'Female',
       'Female', 'Female', 'Female', 'Male', 'Female', 'Female', 'Female',
       'Female', 'Female', 'Male', 'Male', 'Male', 'Male', 'Female',
       'Male', 'Female', 'Male', 'Female', 'Female', 'Female', 'Female',
       'Female', 'Male', 'Female', 'Male', 'Male', 'Female', 'Female',
       'Female', 'Male', 'Male', 'Female', 'Male', 'Female', 'Female',
       'Male', 'Male', 'Male', 'Female', 'Male', 'Female', 'Male', 'Male',
       'Male', 'Female', 'Female', 'Female', 'Female', 'Female', 'Male',
       'Female', 'Female', 'Male', 'Female', 'Female', 'Male', 'Female',
       'Male', 'Female', 'Female', 'Male', 'Female', 'Male', 'Male',
       'Female', 'Male'], dtype=object)

# Evaluate Model using Confusion Matrix and sklearn

In [19]:
# making the confusion matrix
from sklearn.metrics import confusion_matrix
cm = confusion_matrix(y_test, y_pred)
cm

array([[27, 17],
       [20, 16]], dtype=int64)

# True Positive is 27

# True Negative is 16

# False Positive is 17

# False Negative is 20

# Evaluate the model using other performance metrics

In [23]:
from sklearn.metrics import classification_report
print(classification_report(y_test, y_pred))

              precision    recall  f1-score   support

      Female       0.57      0.61      0.59        44
        Male       0.48      0.44      0.46        36

    accuracy                           0.54        80
   macro avg       0.53      0.53      0.53        80
weighted avg       0.53      0.54      0.54        80